In [1]:
a = 1, 2, 3, 4, 5

In [2]:
a[:-1]

(1, 2, 3, 4)

In [3]:
4 in a

True

In [16]:
import pandas as pd
df = pd.read_csv('data/Student_Behaviour3_1.csv')
df.head(1)

,Certification Course,Gender,Height(CM),Weight(KG),10th Mark,12th Mark,college mark,daily studing time,salary expectation,Do you like your degree?,...,Financial Status,part-time job,B.com Accounting and Finance,B.com ISM,BCA,Cinema,Reading books,Sports,Anytime,Morning
0,0,1,100.0,58.0,79.0,65.0,80.0,0,40000,0,...,1,0,0.0,0.0,1.0,0.0,0.0,0.0,0.0,1.0

In [15]:
df1 = df.drop('Gender', axis=1)
df1.head(1)

,Certification Course,Department,Height(CM),Weight(KG),10th Mark,12th Mark,college mark,hobbies,daily studing time,prefer to study in,salary expectation,Do you like your degree?,willingness to pursue a career based on their degree(%),social medai & video,Travelling Time,Stress Level,Financial Status,part-time job
0,No,BCA,100.0,58.0,79.0,65.0,80.0,Video Games,0 - 30 minute,Morning,40000,No,50,1.30 - 2 hour,30 - 60 minutes,Bad,Bad,No

In [14]:
b = pd.DataFrame(df['Gender'])
b['Department'] = df['Department']
b

     Gender Department
0      Male        BCA
1    Female        BCA
2      Male        BCA
3    Female        BCA
4      Male        BCA
..      ...        ...
229    Male  B.com ISM
230    Male  B.com ISM
231  Female        BCA
232  Female   Commerce
233  Female  B.com ISM

[234 rows x 2 columns]